docs/schedule.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-07-05 Mon 21:32 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>OO Software Specification and Construction (SWE 619 Course Schedule - Spring 2021)</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="ThanhVu (Vu) Nguyen" />
<link rel="stylesheet" href="https://nguyenthanhvuh.github.io/files/org.css">
</head>
<body>
<div id="content">
<h1 class="title">OO Software Specification and Construction (SWE 619 Course Schedule - Spring 2021)</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org635b7dd">1. Schedule</a></li>
<li><a href="#org7ada6ab">2. Links</a></li>
</ul>
</div>
</div>

<div id="outline-container-org635b7dd" class="outline-2">
<h2 id="org635b7dd"><span class="section-number-2">1</span> Schedule</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><p>
<b>Notes</b>: Except for the first class, I expect students to have completed the reading <b>prior to class</b> on listed meeting. Quizzes may occasionally take advantage of this expectation.
</p>

<p>
Homework assignments are <b>due</b> on the date listed. Quizzes are posted, with solutions, on Piazza following the class in which the quiz is given.
</p></li>
</ul>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-right">Meeting</th>
<th scope="col" class="org-left">Topic</th>
<th scope="col" class="org-left">Reading</th>
<th scope="col" class="org-left">Assignment/Oral Assessment Guide</th>
<th scope="col" class="org-left">In-Class Exercise</th>
<th scope="col" class="org-left">Video Link</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-right">1</td>
<td class="org-left">Class Overview</td>
<td class="org-left">Liskov 1&#x2013;2</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">IC <a href="./inclass00.html">0</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">2</td>
<td class="org-left">Procedural Abstraction; Exceptions</td>
<td class="org-left">Liskov 3&#x2013;4, Bloch 10</td>
<td class="org-left"><a href="./assign01.html">A1 Due</a>; <a href="./guide01.html">Guide 1</a></td>
<td class="org-left">IC 1 <a href="./inclass01A.html">A</a> <a href="./inclass01B.html">B</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">3</td>
<td class="org-left">Data Abstraction; Mutability</td>
<td class="org-left">Liskov 5.1&#x2013;5.4, LiskovSet.java,  Poly.java</td>
<td class="org-left"><a href="./assign02.html">A2 Due</a>; <a href="./guide02.html">Guide 2</a></td>
<td class="org-left">IC 2 <a href="./inclass02A.html">A</a> <a href="./inclass02B.html">B</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">4</td>
<td class="org-left">Reasoning About Data Abstraction</td>
<td class="org-left">Liskov 5.5-5.10 More Liskov 5.5-5.10</td>
<td class="org-left"><a href="./assign03.html">A3 Due</a>; <a href="./guide03.html">Guide 3</a></td>
<td class="org-left">IC 3 <a href="./inclass03A.html">A</a> <a href="./inclass03B.html">B</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">5</td>
<td class="org-left">Interation Abstraction; Method Guidelines</td>
<td class="org-left">Liskov 6 Bloch 8</td>
<td class="org-left"><a href="./assign04.html">A4 Due</a>; <a href="./guide04.html">Guide 4</a></td>
<td class="org-left">IC 4 <a href="./inclass04A.html">A</a> <a href="./inclass04B.html">B</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">6</td>
<td class="org-left">Type Abstraction</td>
<td class="org-left">Liskov 7</td>
<td class="org-left"><a href="./assign05.html">A5 Due</a>; <a href="./guide01.html">Guide 5</a></td>
<td class="org-left">IC 5 <a href="./inclass05A.html">A</a> <a href="./inclass05B.html">B</a> <a href="./inclass05C.html">C</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">7</td>
<td class="org-left">Mid-semester Recap</td>
<td class="org-left"><i>No New Material</i></td>
<td class="org-left"><a href="./guide06.html">Guide 6</a></td>
<td class="org-left">IC 6 <a href="./inclass06A.html">A</a> <a href="./inclass06B.html">B</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">8</td>
<td class="org-left">Polymorphic Abstract; Lambdas</td>
<td class="org-left">Liskov 8, Bloch 7(Item 42)</td>
<td class="org-left"><a href="./assign06.html">A6 Due</a>; <a href="./guide03.html">Guide 7</a></td>
<td class="org-left">IC 7 <a href="./inclass07A.html">A</a> <a href="./inclass07B.html">B</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">9</td>
<td class="org-left">Generics</td>
<td class="org-left">Bloch 5</td>
<td class="org-left"><a href="./assign07.html">A7 Due</a>; <a href="./guide04.html">Guide 8</a></td>
<td class="org-left">IC 8 <a href="./inclass08A.html">A</a> <a href="./inclass08B.html">B</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">10</td>
<td class="org-left">Common Java Contracts</td>
<td class="org-left">Bloch 3</td>
<td class="org-left"><a href="./assign08.html">A8 Due</a>; <a href="./guide01.html">Guide 9</a></td>
<td class="org-left">IC 9 <a href="./inclass09A.html">A</a> <a href="./inclass09B.html">B</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">11</td>
<td class="org-left">Classes and Inheritance</td>
<td class="org-left">Bloch 4</td>
<td class="org-left"><a href="./assign09.html">A9 Due</a>; <a href="./guide02.html">Guide 10</a></td>
<td class="org-left">IC 10 <a href="./inclass10A.html">A</a> <a href="./inclass10B.html">B</a>  <a href="./inclass10C.html">C</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">12</td>
<td class="org-left">Contract Model in Testing</td>
<td class="org-left">Advanced JUnit (slides 22-24)</td>
<td class="org-left"><a href="./assign10.html">A10 Due</a>; <a href="./guide03.html">Guide 11</a></td>
<td class="org-left">IC <a href="./inclass11.html">11</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">13</td>
<td class="org-left">Enums and Annotations</td>
<td class="org-left">Bloch 6</td>
<td class="org-left"><a href="./assign11.html">A11 Due</a>; <a href="./guide04.html">Guide 12</a></td>
<td class="org-left">IC 12 <a href="./inclass12A.html">A</a> <a href="./inclass12B.html">B</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">14</td>
<td class="org-left">Course Wrap Up</td>
<td class="org-left">Final Exam Notes; Code for final</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">IC <a href="./inclass13.html">13</a></td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-right">15</td>
<td class="org-left">Final Exam @ 4:30</td>
<td class="org-left"><i>Online</i></td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
<tbody>
<tr>
<td class="org-right">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>

<div id="outline-container-org7ada6ab" class="outline-2">
<h2 id="org7ada6ab"><span class="section-number-2">2</span> Links</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li><a href="./index.html">Syllabus</a></li>
<li><a href="./schedule.html">Schedule</a></li>
</ul>
</div>
</div>
</div>
</body>
</html>
